{
  "protocolName": "LNURL-auth",
  "overview": "LNURL-auth is a specialized application of LNURL that enables challenge–response authentication using deterministic per-domain keypairs. It combines the UX affordance of QR-based flows with the cryptographic robustness of Ed25519 or Secp256k1 signatures. The protocol is designed to be simple: no blockchain interaction, no Lightning payment channel required, no invoice settlement. Pure offline signing and verification.",
  "flowDiagramSteps": [
    "1. Client requests a login session from the server.",
    "2. Server generates a 32-byte random `k1` challenge and stores it temporarily.",
    "3. Server encodes the auth request into an LNURL string (bech32).",
    "4. Wallet scans LNURL and derives a per-domain deterministic private key.",
    "5. Wallet signs the `k1` challenge with this derived private key.",
    "6. Wallet sends `{ key: pubkey, sig: signature, k1: challenge }` to the callback URL.",
    "7. Server verifies: `verifySig(pubkey, sig, k1)`.",
    "8. If valid, server binds pubkey → user and creates a session."
  ],
  "cryptography": {
    "keys": "LNURL-auth wallets derive per-domain keys using hierarchical deterministic logic. This prevents cross-site correlation while still allowing users to preserve access over time. Some wallets use BIP32-like derivation; others maintain an internal derivation scheme.",
    "signatures": "Signatures are typically Secp256k1 ECDSA signatures, although some wallets may adopt Ed25519. The important detail: the signature covers only the `k1` challenge and not arbitrary messages, making verification straightforward.",
    "challengeResponse": "The challenge (`k1`) is a random nonce. The wallet signs this nonce as proof of possession of the domain-derived private key. The signature is valid only for this login attempt — preventing replay attacks when implemented correctly."
  },
  "serverResponsibilities": [
    "Generate cryptographically secure 32-byte random values (`k1`).",
    "Store `k1` temporarily (5-minute expiry recommended).",
    "Associate `k1` with a pending login attempt or session fingerprint.",
    "Verify signatures using the LNURL-auth crypto spec.",
    "Create new user records when a previously unseen pubkey logs in.",
    "Invalidate `k1` immediately after successful verification."
  ],
  "walletResponsibilities": [
    "Recognize the LNURL-auth request type and parse metadata.",
    "Derive a domain-specific private key.",
    "Prompt user to approve login.",
    "Sign the `k1` challenge.",
    "Send `{ key, sig, k1 }` to callback."
  ],
  "risks": [
    "If `k1` values are not expired or invalidated, replay attacks become possible.",
    "If the same pubkey is reused across non-LNURL-auth contexts, linkability increases.",
    "Server operators must avoid storing or logging private data from wallets.",
    "A compromised wallet compromises all derived identities.",
    "Improper verification libraries can introduce signature validation bypasses."
  ]
}
